
# Проект предоставляет простой и эффективный инструмент для анализа эмоциональной окраски текстов на русском языке с использованием предобученной модели RuBERT.

## 🚀 Основные возможности

### 📊 Многофакторный анализ тональности
- **Три класса эмоций** - позитивный, негативный и нейтральный
- **Сбалансированная модель** - точное распознавание нюансов эмоций
- **Вероятностная оценка** - количественная мера уверенности модели

### 📁 Гибкие источники данных
- **Пакетная обработка** - одновременный анализ множества текстов
- **Поддержка UTF-8** - корректная работа с русским языком
- **Автоочистка данных** - фильтрация пустых строк

### ⚡ Мгновенный анализ
- **Предобученная модель** - готовность к работе без дообучения
- **Оптимизированная архитектура** - быстрое выполнение даже на CPU
- **Потоковая обработка** - эффективная работа с большими объемами

## 🛠 Технические преимущества

### 🔧 Простота использования

### 📊 Структурированный вывод
```python
for text, res in zip(texts, results):
    print(f"Текст: {text}")
    print(f"Класс: {res['label']}, вероятность: {res['score']:.4f}")
```

### ⚡ Автоматизация процессов
- **Автозагрузка модели** - модель загружается автоматически при инициализации
- **Предобработка текста** - встроенная токенизация и нормализация
- **Пакетное предсказание** - оптимизированная обработка групп текстов

## 🎯 Ключевые преимущества

- **Специализация на русском языке** - оптимизированная работа с русскоязычными текстами
- **Высокая точность** - сбалансированная модель для точного определения тональности
- **Простота интеграции** - минимальный код для получения результатов
- **Пакетная обработка** - эффективная работа с большими наборами данных
- **Готовность к использованию** - не требует обучения или тонкой настройки

## 🔧 Технические детали

### Используемая модель:
- `cointegrated/rubert-tiny-sentiment-balanced` - оптимизированная для русского языка

### Поддерживаемые классы:
- **positive** - позитивная тональность
- **negative** - негативная тональность  
- **neutral** - нейтральная тональность

### Формат входных данных:
- Текстовые файлы в кодировке UTF-8
- По одному тексту на строку
- Поддержка текстов различной длины
